Rhino.Inside.Revit API
GeometryEncoder.ToCurve Method (PolyCurve)
 Converts the specified Rhino.Geometry.PolyCurve to an equivalent of Autodesk.Revit.DB.Curve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Curve ToCurve(
	this Rhino.Geometry.PolyCurve polyCurve
)
@staticmethod
def ToCurve(
	polyCurve: Rhino.Geometry.PolyCurve
) -> Autodesk.Revit.DB.Curve
Parameters
polyCurve
Type: Rhino.Geometry.PolyCurve
Rhino polyCurve to convert.
Return Value
Type: Autodesk.Revit.DB.Curve
Revit curve that is equivalent to the provided Rhino polyCurve.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.PolyCurve. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToCurve(PolyCurve) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = rhinoPolyCurve.ToCurve();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_curve = rhino_polycurve.ToCurve()    # type: DB.Curve
 Using ToCurve(PolyCurve) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Curve revitCurve = GeometryEncoder.ToCurve(rhinoPolyCurve);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_curve = GE.ToCurve(rhino_polycurve)    # type: DB.Curve
See Also
Reference
GeometryEncoder Class
ToCurve Overload
RhinoInside.Revit.Convert.Geometry Namespace